АлогистикТест2/src/DataProcessors/алк_ПечатьТН/алк_ПечатьТН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_ПечатьТН</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ПеремещениеЗапасов</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.алк_ОтгрузкаЩепы</types>
      <types>DocumentRef.алк_ТранспортировкаЗапасов</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

АлогистикТест2/src/Documents/алк_ТранспортировкаЗапасов/алк_ТранспортировкаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ТранспортировкаЗапасов</name>
  <basedOn>Document.алк_РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОтгрузкиПоЗаказам</registerRecords>
  <registerRecords>AccumulationRegister.алк_ТоварыВПути</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.алк_ОтгрузкаРН</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическийЦентрОтправитель</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическийЦентрПолучатель</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаОтправитель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктОтправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.алк_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспорта</name>
    <type>
      <types>EnumRef.алк_ВидыТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Пломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОнЖе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемТаможняДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоподъемность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетОснованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоответствуетОснованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВ_ТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Мультизаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКУчету_ТД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопАналитика</name>
    <type>
      <types>CatalogRef.алк_АналитикаРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаИДКонтейнеров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБруттоПриВзвешивании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБруттоПриВзвешиванииВПорту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПорученияЭкспедитору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесКонтейнера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриемкаВПорту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемкаВПортуДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Задекларирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНеттоПриВзвешивании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьИдентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.алк_Аддендумы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоПорт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоПорт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизит</name>
    <attributes>
      <name>УпакРеквизит</name>
      <type>
        <types>CatalogRef.алк_Реквизит</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесРеквизита</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.алк_РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьЗаказ</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/DataProcessors/алк_ПечатьТН/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьГрузоотправителяПоТранспортировке(ДокументОснование, МетаданныеДокумента)
	
	Если НЕ МетаданныеДокумента.Реквизиты.Найти("Грузоотправитель") = Неопределено 
		И ЗначениеЗаполнено(ДокументОснование.Грузоотправитель) Тогда
		
		ГрузоотправительДляПечати	= ДокументОснование.Грузоотправитель; 		
	Иначе 		
		ГрузоотправительДляПечати	= ДокументОснование.Организация;  	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГрузоотправительДляПечати) Тогда
		
		Если ТипЗнч(ГрузоотправительДляПечати) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			ЭтоФизЛицо = (ГрузоотправительДляПечати.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
			ИЛИ (ГрузоотправительДляПечати.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо);
			
		Иначе
			
			ЭтоФизЛицо = (ГрузоотправительДляПечати.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
			
		КонецЕсли;
		
		ВидГрузоотправителя			= ?(ЭтоФизЛицо, КэшЗначений.ФизЛицо, КэшЗначений.ЮрЛицо);
		СведенияОГрузоотправителе 	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ГрузоотправительДляПечати, ДокументОснование.Дата);
		
		ЭтаФорма[?(ЭтоФизЛицо, "ГрузоотправительФЛ", "ГрузоотправительЮЛ")]
		= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузоотправителе,
		?(ЭтоФизЛицо, "ПолноеНаименование, ИНН, ЮридическийАдрес", 
		"ПолноеНаименование, ИНН, ЮридическийАдрес"));
		
		Если ТипЗнч(ГрузоотправительДляПечати) = Тип("СправочникСсылка.Организации")
			И ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиницаОтправитель.МОЛ) Тогда
			
			ОтветственныйГрузоотправитель = РегистрыСведений.ФИОФизЛиц.ФИОФизЛица(ДокументОснование.Дата, ДокументОснование.СтруктурнаяЕдиница.МОЛ);
			
		ИначеЕсли ТипЗнч(ГрузоотправительДляПечати) = Тип("СправочникСсылка.Контрагенты") 
			И НЕ ГрузоотправительДляПечати.Метаданные().Реквизиты.Найти("КонтактноеЛицо") = НЕОПРЕДЕЛЕНО Тогда
			
			ОтветственныйГрузоотправитель = ГрузоотправительДляПечати.КонтактноеЛицо.Наименование;
			
		КонецЕсли;
		
	Иначе
		
		ВидГрузоотправителя = КэшЗначений.ЮрЛицо;
		
	КонецЕсли;
	
	ГрузоотправительПункт16_1 = ГрузоотправительЮЛ;
	
КонецПроцедуры // ЗаполнитьГрузоотправителяПоТранспортировке()

&НаСервере
Процедура ЗаполнитьАдресВыгрузкиПоТранспортировке(ДокументОснование, МетаданныеДокумента)
	
	
	Покупатель 		= ДокументОснование.Покупатель; 
	Перевозчик 		= ДокументОснование.Перевозчик;
	Грузополучатель = ДокументОснование.Грузополучатель;
		
	Если ЗначениеЗаполнено(Покупатель) Тогда	
		ГрузополучательДляПечати = Покупатель;		
	ИначеЕсли ЗначениеЗаполнено(Перевозчик) Тогда	
		ГрузополучательДляПечати = Перевозчик;  	
	ИначеЕсли ЗначениеЗаполнено(Грузополучатель) Тогда	
		ГрузополучательДляПечати = Грузополучатель;
	Иначе 
		Возврат;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ГрузополучательДляПечати) Тогда		
		СведенияОГрузополучателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ГрузополучательДляПечати, ДокументОснование.Дата);
		ЭтаФорма.АдресВыгрузки = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ЮридическийАдрес");// + ", " + НазначитьСкладПолучателяИзТранспортировки(ДокументОснование);
	КонецЕсли;
	
	//Если НЕ МетаданныеДокумента.Реквизиты.Найти("Грузополучатель") = Неопределено Тогда //это перевозчик в документе
	//	Если ЗначениеЗаполнено(ДокументОснование.Грузополучатель) Тогда
	//		СведенияОГрузополучателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ДокументОснование.Перевозчик, ДокументОснование.Дата);
	//		//СведенияОГрузополучателе.ЮридическийАдрес = СведенияОГрузополучателе.ФактическийАдрес;
	//		//Если ЗначениеЗаполнено(СведенияОПеревозчике.ФактическийАдрес) тогда  
	//		//	ЭтаФорма.АдресВыгрузки = СведенияОПеревозчике.ПолноеНаименование + ", "+СведенияОПеревозчике.ФактическийАдрес;
	//		//Иначе
	//		//	ЭтаФорма.АдресВыгрузки = СведенияОПеревозчике.ПолноеНаименование;
	//		//КонецЕсли;
	//		ЭтаФорма.АдресВыгрузки = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ЮридическийАдрес") + ", " + НазначитьСкладПолучателяИзТранспортировки(ДокументОснование);
	//	КонецЕсли;	
	//КонецЕсли;
	
КонецПроцедуры // ЗаполнитьГрузоотправителяПоТранспортировке()    

&НаСервереБезКонтекста
Функция НазначитьСкладПолучателяИзТранспортировки(ДокументОснование)
	
	СкладПолучатель = "";
	Если ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиницаПолучатель) Тогда 
		СкладПолучатель = ДокументОснование.СтруктурнаяЕдиницаПолучатель.Наименование; 
	КонецЕсли; 
	
	Возврат СкладПолучатель;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПеревозчикВыгрузкиПоТранспортировке(ДокументОснование, МетаданныеДокумента)
	
	Если НЕ МетаданныеДокумента.Реквизиты.Найти("Грузополучатель") = Неопределено 
		И ЗначениеЗаполнено(ДокументОснование.Грузополучатель) Тогда
		
		ПеревозчикДляПечати	= ДокументОснование.Грузополучатель; 		
	Иначе 
		Возврат; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПеревозчикДляПечати) Тогда
		
		Если ТипЗнч(ПеревозчикДляПечати) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			ЭтоФизЛицо = (ПеревозчикДляПечати.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
			ИЛИ (ПеревозчикДляПечати.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо);
			
		Иначе
			
			ЭтоФизЛицо = (ПеревозчикДляПечати.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
			
		КонецЕсли;
		
		ВидПеревозчика			= ?(ЭтоФизЛицо, КэшЗначений.ФизЛицо, КэшЗначений.ЮрЛицо);
		СведенияОПеревозчике	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ПеревозчикДляПечати, ДокументОснование.Дата);
		
		ЭтаФорма[?(ЭтоФизЛицо, "ПеревозчикФЛ", "ПеревозчикЮЛ")]
		= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПеревозчике,
		?(ЭтоФизЛицо, "ПолноеНаименование, ИНН, ЮридическийАдрес", 
		"ПолноеНаименование, ИНН, ЮридическийАдрес"));
				
	Иначе
		
		ВидПеревозчика = КэшЗначений.ЮрЛицо;
		
	КонецЕсли;
	
	//здесь должен заполняться водитель, но данного реквизита нет
	//Если НЕ ПеревозчикДляПечати.Метаданные().Реквизиты.Найти("КонтактноеЛицо") = НЕОПРЕДЕЛЕНО Тогда
	//		
	//		ОтветственныйЗаПеревозку = ПеревозчикДляПечати.КонтактноеЛицо.Наименование;
	//		
	//КонецЕсли;
	
	ПеревозчикПункт16_2 = ПеревозчикЮЛ;

		
КонецПроцедуры // ЗаполнитьГрузоотправителяПоТранспортировке()


&НаСервере
Процедура ЗаполнитьГрузополучателяПоТранспортировке(ДокументОснование, МетаданныеДокумента)
	
	//Если НЕ МетаданныеДокумента.Реквизиты.Найти("Грузополучатель") = Неопределено 
	//	И ЗначениеЗаполнено(ДокументОснование.Грузополучатель) Тогда 
	//	
	//	ГрузополучательДляПечати	= ДокументОснование.Грузополучатель; //это перевозчик в документе		
	//Иначе
	//	Возврат;
	//		
	//КонецЕсли; 
	
	Покупатель 		= ДокументОснование.Покупатель; 
	Перевозчик 		= ДокументОснование.Перевозчик;
	Грузополучатель = ДокументОснование.Грузополучатель;
		
	Если ЗначениеЗаполнено(Покупатель) Тогда	
		ГрузополучательДляПечати = Покупатель;		
	ИначеЕсли ЗначениеЗаполнено(Перевозчик) Тогда	
		ГрузополучательДляПечати = Перевозчик;  	
	ИначеЕсли ЗначениеЗаполнено(Грузополучатель) Тогда	
		ГрузополучательДляПечати = Грузополучатель;
	Иначе 
		Возврат;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ГрузополучательДляПечати) Тогда
		
		ЭтоФизЛицо					= (ГрузополучательДляПечати.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
										ИЛИ (ГрузополучательДляПечати.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо);
		ВидГрузополучателя			= ?(ЭтоФизЛицо, КэшЗначений.ФизЛицо, КэшЗначений.ЮрЛицо);
		СведенияОГрузополучателе	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ГрузополучательДляПечати, ДокументОснование.Дата); 
		
		ЭтаФорма[?(ЭтоФизЛицо, "ГрузополучательФЛ", "ГрузополучательЮЛ")]
			= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузополучателе,
										?(ЭтоФизЛицо, "ЮридическийАдрес", 
														"ЮридическийАдрес")); // + ", " + НазначитьСкладПолучателяИзТранспортировки(ДокументОснование); 
														
		//Если НЕ ГрузополучательДляПечати.Метаданные().Реквизиты.Найти("КонтактноеЛицо") = НЕОПРЕДЕЛЕНО Тогда
		//	
		//	ОтветственныйГрузополучатель = ГрузополучательДляПечати.КонтактноеЛицо.Наименование;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрузоотправителяПоРасходнойНакладной(ДокументОснование, МетаданныеДокумента)
	
	Если НЕ МетаданныеДокумента.Реквизиты.Найти("Грузоотправитель") = Неопределено 
		И ЗначениеЗаполнено(ДокументОснование.Грузоотправитель) Тогда
		
		ГрузоотправительДляПечати	= ДокументОснование.Грузоотправитель;
		
	ИначеЕсли НЕ МетаданныеДокумента.Реквизиты.Найти("Организация") = Неопределено 
		И ЗначениеЗаполнено(ДокументОснование.Организация) Тогда
		
		ГрузоотправительДляПечати	= ДокументОснование.Организация;
		
	ИначеЕсли ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиница) 
		И ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиница.Организация)  Тогда
		
		ГрузоотправительДляПечати	= ДокументОснование.СтруктурнаяЕдиница.Организация;
		
	Иначе
		
		ГрузоотправительДляПечати	= ДокументОснование.Организация;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГрузоотправительДляПечати) Тогда
		
		Если ТипЗнч(ГрузоотправительДляПечати) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			ЭтоФизЛицо = (ГрузоотправительДляПечати.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
							ИЛИ (ГрузоотправительДляПечати.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо);
				
		Иначе
			
			ЭтоФизЛицо = (ГрузоотправительДляПечати.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
			
		КонецЕсли;
		
		ВидГрузоотправителя			= ?(ЭтоФизЛицо, КэшЗначений.ФизЛицо, КэшЗначений.ЮрЛицо);
		СведенияОГрузоотправителе 	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ГрузоотправительДляПечати, ДокументОснование.Дата);
		
		ЭтаФорма[?(ЭтоФизЛицо, "ГрузоотправительФЛ", "ГрузоотправительЮЛ")]
		 			= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузоотправителе,
										?(ЭтоФизЛицо, "ПолноеНаименование, ИНН, ФактическийАдрес", 
														"ПолноеНаименование, ФактическийАдрес, Телефоны"));
		
		Если ТипЗнч(ГрузоотправительДляПечати) = Тип("СправочникСсылка.Организации")
			И ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиница.МОЛ) Тогда
			
			ОтветственныйГрузоотправитель = РегистрыСведений.ФИОФизЛиц.ФИОФизЛица(ДокументОснование.Дата, ДокументОснование.СтруктурнаяЕдиница.МОЛ);
			
		ИначеЕсли ТипЗнч(ГрузоотправительДляПечати) = Тип("СправочникСсылка.Контрагенты") 
			И НЕ ГрузоотправительДляПечати.Метаданные().Реквизиты.Найти("КонтактноеЛицо") = НЕОПРЕДЕЛЕНО Тогда
			
			ОтветственныйГрузоотправитель = ГрузоотправительДляПечати.КонтактноеЛицо.Наименование;
			
		КонецЕсли;
		
	Иначе
		
		ВидГрузоотправителя = КэшЗначений.ЮрЛицо;
		
	КонецЕсли;
	
	УправлениеДоступностьюГрузоотправителяНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрузополучателяПоРасходнойНакладной(ДокументОснование, МетаданныеДокумента)
	
	Если НЕ МетаданныеДокумента.Реквизиты.Найти("Грузополучатель") = Неопределено 
		И ЗначениеЗаполнено(ДокументОснование.Грузополучатель) Тогда
		
		ГрузополучательДляПечати	= ДокументОснование.Грузополучатель;
		
	Иначе
		
		ГрузополучательДляПечати	= ДокументОснование.Контрагент;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГрузополучательДляПечати) Тогда
		
		ЭтоФизЛицо					= (ГрузополучательДляПечати.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
										ИЛИ (ГрузополучательДляПечати.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо);
		ВидГрузополучателя			= ?(ЭтоФизЛицо, КэшЗначений.ФизЛицо, КэшЗначений.ЮрЛицо);
		СведенияОГрузополучателе	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ГрузополучательДляПечати, ДокументОснование.Дата);
		
		ЭтаФорма[?(ЭтоФизЛицо, "ГрузополучательФЛ", "ГрузополучательЮЛ")]
			= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузополучателе,
										?(ЭтоФизЛицо, "ПолноеНаименование, ИНН, ФактическийАдрес", 
														"ПолноеНаименование, ФактическийАдрес, Телефоны"));
														
		Если НЕ ГрузополучательДляПечати.Метаданные().Реквизиты.Найти("КонтактноеЛицо") = НЕОПРЕДЕЛЕНО Тогда
			
			ОтветственныйГрузополучатель = ГрузополучательДляПечати.КонтактноеЛицо.Наименование;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеДоступностьюГрузополучателяНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПеревозчика(ДокументОснование, МетаданныеДокумента)
	
	ВидПеревозчика = КэшЗначений.ЮрЛицо;
	
	УправлениеДоступностьюПеревозчикаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДоступностьюГрузоотправителяНаСервере()
	
	Если ВидГрузоотправителя = КэшЗначений.ЮрЛицо Тогда
		
		ГрузоотправительФЛ = "";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузоотправительЮЛ", "Доступность", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузоотправительФЛ", "Доступность", Ложь);
		
	Иначе
		
		ГрузоотправительЮЛ = "";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузоотправительЮЛ", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузоотправительФЛ", "Доступность", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДоступностьюГрузополучателяНаСервере()
	
	Если ВидГрузополучателя = КэшЗначений.ЮрЛицо Тогда
		
		ГрузополучательФЛ = "";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузополучательЮЛ", "Доступность", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузополучательФЛ", "Доступность", Ложь);
		
	Иначе
		
		ГрузополучательЮЛ = "";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузополучательЮЛ", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузополучательФЛ", "Доступность", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДоступностьюПеревозчикаНаСервере()
	
	Если ВидПеревозчика = КэшЗначений.ЮрЛицо Тогда
		
		ПеревозчикФЛ = "";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеревозчикЮЛ", "Доступность", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеревозчикФЛ", "Доступность", Ложь);
		
	Иначе
		
		ПеревозчикЮЛ = "";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеревозчикЮЛ", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеревозчикФЛ", "Доступность", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция возвращает табличный документ для печати ТН
Функция ПечатнаяФорма(МассивОбъектов, ПараметрыПечати, ОбъектыПечати) Экспорт

	ТабличныйДокумент			= Новый ТабличныйДокумент;
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбъектОбработка.ПолучитьМакет("ТТНПриложение4_с_210209"); //ПФ_MXL_ТранспортнаяНакладная");
	
	//Если ОбъектОбработка.ЭтоВнешняяОбработкаОтчет() Тогда
	//
	//Иначе
	//Макет 						= РеквизитФормыВЗначение("Объект").ПолучитьМакет("ТТНПриложение4_с_210209"); //ПФ_MXL_ТранспортнаяНакладная");
	//
	//КонецЕсли; 
	ВывестиГоризонтРазделитель	= Ложь;
	
	Для каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если ВывестиГоризонтРазделитель Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ВывестиГоризонтРазделитель	= Истина;
		КонецЕсли;
		
		НомерСтрокиНачало 						= ТабличныйДокумент.ВысотаТаблицы + 1;
		ТабличныйДокумент.ИмяПараметровПечати 	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПечатьТН_ТН";
		
		//:::Лицевая
		ОбластьМакета 				= Макет.ПолучитьОбласть("ЧастьПервая");
		ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ОбластьМакета 				= Макет.ПолучитьОбласть("ЧастьВторая");
		ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//:::Оборотная
		ОбластьМакетаОборотная		= Макет.ПолучитьОбласть("ЧастьТретья");
		ОбластьМакетаОборотная.Параметры.Заполнить(ПараметрыПечати);
		ТабличныйДокумент.Вывести(ОбластьМакетаОборотная);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, ТабличныйДокумент.ВысотаТаблицы + 1, ОбъектыПечати, ТекущийДокумент);
		
		//:::Параметры макета
		ТабличныйДокумент.ПолеСверху = 0;
		ТабличныйДокумент.ПолеСлева  = 0;
		ТабличныйДокумент.ПолеСнизу  = 0;
		ТабличныйДокумент.ПолеСправа = 0;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

&НаСервере
// Процедура заполняет реквизиты формы значениями из документа основания
// 
// Заполняются не все реквизиты
//
Процедура ЗаполнитьПоДокументуРасходнаяНакладная()
	
	ДокументОснование	= Объект.Документ;
	МетаданныеДокумента	= ДокументОснование.Метаданные();
	НомерЭкземпляра 	= 1;
	
	//:::Грузоотправитель
	ЗаполнитьГрузоотправителяПоРасходнойНакладной(ДокументОснование, МетаданныеДокумента);
	
	//:::Грузополучатель
	ЗаполнитьГрузополучателяПоРасходнойНакладной(ДокументОснование, МетаданныеДокумента);
	
	//:::Перевозчик
	ЗаполнитьПеревозчика(ДокументОснование, МетаданныеДокумента);
	
	
КонецПроцедуры //ЗаполнитьПоДокументу()

&НаСервере
// Процедура заполняет реквизиты формы значениями из документа основания
// 
// Заполняются не все реквизиты
//
Процедура ЗаполнитьПоДокументуТранспортировкаЗапасов()
	
	ДокументОснование	= Объект.Документ;
	МетаданныеДокумента	= ДокументОснование.Метаданные();
	НомерЭкземпляра 	= 1;
	
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНетто,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто КАК ВесБрутто,
		|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК КоличествоСостав,
		|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
		|	1 КАК КоличествоПакетов,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Пломбы КАК Пломбы,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК Дата,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаСмены КАК ДатаСмены
		|ИЗ
		|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
		|ГДЕ
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СерийныйНомер),
		|	СУММА(ВесНетто),
		|	СУММА(ВесБрутто),
		|	СУММА(КоличествоСостав),
		|	МАКСИМУМ(Номенклатура),
		|	СУММА(КоличествоПакетов),
		|	МАКСИМУМ(Пломбы),
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(ДатаСмены)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	// Вставить обработку выборки ВыборкаОбщийИтог
	
	ВыборкаДетальныеЗаписи = ВыборкаОбщийИтог.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	//:::Грузоотправитель
	ЗаполнитьГрузоотправителяПоТранспортировке(ДокументОснование, МетаданныеДокумента);
	
	//:::Грузополучатель
	ЗаполнитьГрузополучателяПоТранспортировке(ДокументОснование, МетаданныеДокумента);
	
	//:::Перевозчик
	ЗаполнитьПеревозчикВыгрузкиПоТранспортировке(ДокументОснование, МетаданныеДокумента);
	//ЗаполнитьПеревозчика(ДокументОснование, МетаданныеДокумента);
	
	//:::Адрес выгрузки
	ЗаполнитьАдресВыгрузкиПоТранспортировке(ДокументОснование, МетаданныеДокумента);
	
	ДатаЗаявки  = ДокументОснование.Дата;
	НомерЗаявки = Формат(ДокументОснование.Номер, "ЧГ=");
	
	Если ВыборкаОбщийИтог.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000018") Тогда	//Пеллеты	
		
		НаименованиеГруза = "Пеллеты"; 		
		ДанныеДляПечати = Документы[МетаданныеДокумента.Имя].ПолучитьДанныеДляПечатиТН(ДокументОснование);
		
		//упаковка - биг-бэг, 24201 кг
		
		КоличествоМестМаркировка = "упаковка - биг-бэг, " + ВыборкаОбщийИтог.КоличествоСостав + " кг";
		
		//36 (тридцать шесть) грузовых мест    36(тридцать шесть)Биг-бэгов
		
		ГрузовыеМеста =  "" + ВыборкаОбщийИтог.КоличествоПакетов 
		+ " (" + ЧислоПрописью(ВыборкаОбщийИтог.КоличествоПакетов, "НП=Ложь", ",,,,,,,,0") + ") Биг-бэгов"; 
					
		ПрилагаемыеДокументы = "спецификация № " + НомерЗаявки;
		
		АдресПогрузки = "ООО ""РФП ДГ"",682640,Хабаровский край,г.Амурск,шоссе Машиностроителей,6А, ИНН 2706025561";
		
		
		
		// Пункт 6
		
		СостояниеГрузаПриПогрузке =  "пломба " + ВыборкаОбщийИтог.Пломбы;
		МассаГрузаПриЗагрузке = "" + ВыборкаОбщийИтог.КоличествоСостав + " кг";
		МассаГрузаПриВыгрузке = "" + ВыборкаОбщийИтог.КоличествоСостав + " кг";
		КоличествоМестПриЗагрузке = ГрузовыеМеста;
		КоличествоМестПриВыгрузке = ГрузовыеМеста;
		
		СрокПодачиПодПогрузку 		=  Формат(ВыборкаОбщийИтог.ДатаСмены, "ДЛФ=D");
		ФактическоеПрибылПараграф6 	= "8:00";
		ФактическоеУбылПараграф6	= "20:00";
		
		  	
	Иначе   	
		
		НаименованиеГруза = "Пиломатериалы";
		
		ДанныеДляПечати = Документы[МетаданныеДокумента.Имя].ПолучитьДанныеДляПечатиТН(ДокументОснование);
		
		КоличествоМестМаркировка = "" + ДанныеДляПечати.КоличествоМест +  " ("+ЧислоПрописью(ДанныеДляПечати.КоличествоМест, ,",,,,,,,,0" ) + ") грузовых мест, упаковка - пачки";
		
		ГрузовыеМеста = "Объем: " + Формат(ДанныеДляПечати.Объем) + " м3, масса брутто: " + ДанныеДляПечати.ВесБрутто + " т."; 
		
		ПрилагаемыеДокументы = "спецификация № " + НомерЗаявки;
		
		АдресПогрузки = "ООО ""ТД РФП"" (ООО ""Амурская ЛК"" г. Амурск, ш. Машиностроителей, 6)";
		
	КонецЕсли; 
КонецПроцедуры //ЗаполнитьПоДокументуТранспортировкаЗапасов()

&НаСервереБезКонтекста
Функция ЭтоМашина(НомерТС)
	ЭтоМашина = Истина;
	Если СтрДлина(НомерТС) = 8 Тогда
		ЭтоМашина = Ложь;
		Для к = 1 по 8 цикл
			Если СтрНайти("0123456789", Сред(НомерТС,к,1)) = 0 Тогда
				ЭтоМашина = Истина;
				прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат ЭтоМашина;
КонецФункции


&НаСервере
// Процедура заполняет реквизиты формы значениями из документа основания
// 
// Заполняются не все реквизиты
//
Процедура ЗаполнитьПоДокументу_алк_ОтгрузкаЩепы()
	
	ДокументОснование	= Объект.Документ;
	МетаданныеДокумента	= ДокументОснование.Метаданные();
	НомерЭкземпляра 	= 1;
	
	//:::Грузоотправитель
	ЗаполнитьГрузоотправителяПоРасходнойНакладной(ДокументОснование, МетаданныеДокумента);
	
	//:::Грузополучатель
	ЗаполнитьГрузополучателяПоРасходнойНакладной(ДокументОснование, МетаданныеДокумента);
	
	//:::Перевозчик
	ЗаполнитьПеревозчика(ДокументОснование, МетаданныеДокумента);
	
	ДатаЗаявки  = ДокументОснование.Дата;
	НомерЗаявки = Формат(ДокументОснование.Номер, "ЧГ=");
	
	НаименованиеГруза = "Щепа";
	
	//ДанныеДляПечати = Документы[МетаданныеДокумента.Имя].ПолучитьДанныеДляПечатиТН(ДокументОснование);
	//
	//КоличествоМестМаркировка = "" + ДанныеДляПечати.КоличествоМест +  " ("+ЧислоПрописью(ДанныеДляПечати.КоличествоМест, ,",,,,,,,,0" ) + ") грузовых мест, упаковка - пачки";
	//
	ГрузовыеМеста = "Масса нетто: " + ДокументОснование.Запасы.Итог("ВесНетто") + " т."; 
	
	ПрилагаемыеДокументы = "спецификация № " + НомерЗаявки;
	
	АдресПогрузки = "ООО ""ТД РФП"" (ООО ""Амурская ЛК"" г. Амурск, ш. Машиностроителей, 6)";
	
	Если ЭтоМашина(ДокументОснование.ИдентификаторТС) Тогда
		ТипМарка = "Автомашина";
		РегистрационныеНомера = ДокументОснование.ИдентификаторТС;
	КонецЕсли;
	
	
	
КонецПроцедуры //ЗаполнитьПоДокументуТранспортировкаЗапасов()

&НаСервере
// Процедура заполняет реквизиты формы значениями из документа основания
// 
// Заполняются не все реквизиты
//
Процедура ЗаполнитьПоДокументуПеремещениеЗапасов()
	
	ДокументОснование	= Объект.Документ;
	МетаданныеДокумента	= ДокументОснование.Метаданные();
	НомерЭкземпляра 	= 1;
	
	//:::Грузоотправитель
	ВидГрузоотправителя = КэшЗначений.ЮрЛицо;
	Если ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиница) 
		И ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиница.Организация) Тогда
		
		ГрузоотправительДляПечати	= ДокументОснование.СтруктурнаяЕдиница.Организация;
		ЭтоФизЛицо					= (ГрузоотправительДляПечати.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
		ВидГрузоотправителя			= ?(ЭтоФизЛицо, КэшЗначений.ФизЛицо, КэшЗначений.ЮрЛицо);
		СведенияОГрузоотправителе 	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ГрузоотправительДляПечати, ДокументОснование.Дата);
		ЭтаФорма[?(ЭтоФизЛицо, "ГрузоотправительФЛ", "ГрузоотправительЮЛ")]
			= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузоотправителе,
										?(ЭтоФизЛицо, "ПолноеНаименование, ИНН, ФактическийАдрес", 
														"ПолноеНаименование, ФактическийАдрес, Телефоны"));
		
		ОтветственныйГрузоотправитель = РегистрыСведений.ФИОФизЛиц.ФИОФизЛица(ДокументОснование.Дата, ДокументОснование.СтруктурнаяЕдиница.МОЛ);
		
	КонецЕсли;
	
	УправлениеДоступностьюГрузоотправителяНаСервере();
	
	//:::Грузополучатель
	ВидГрузополучателя = КэшЗначений.ЮрЛицо;
	Если ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиницаПолучатель) 
		И ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиницаПолучатель.Организация) Тогда
		
		ГрузополучательДляПечати	= ДокументОснование.СтруктурнаяЕдиницаПолучатель.Организация; 
		ЭтоФизЛицо					= (ГрузополучательДляПечати.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
		ВидГрузополучателя			= ?(ЭтоФизЛицо, КэшЗначений.ФизЛицо, КэшЗначений.ЮрЛицо);
		СведенияОГрузополучателе	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ГрузополучательДляПечати, ДокументОснование.Дата);
		ЭтаФорма[?(ЭтоФизЛицо, "ГрузополучательФЛ", "ГрузополучательЮЛ")]
			= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузополучателе,
										?(ЭтоФизЛицо, "ПолноеНаименование, ИНН, ФактическийАдрес", 
														"ПолноеНаименование, ФактическийАдрес, Телефоны"));
		
		ОтветственныйГрузополучатель = РегистрыСведений.ФИОФизЛиц.ФИОФизЛица(ДокументОснование.Дата, ДокументОснование.СтруктурнаяЕдиницаПолучатель.МОЛ);
		
	КонецЕсли;
	
	УправлениеДоступностьюГрузополучателяНаСервере();
	
	//:::Перевозчик
	ЗаполнитьПеревозчика(ДокументОснование, МетаданныеДокумента);
	
КонецПроцедуры //ЗаполнитьПоДокументуПеремещениеЗапасов()

&НаСервере
// Процедура заполняет реквизиты формы значениями из документа основания
// 
// Заполняются не все реквизиты
//
Процедура ЗаполнитьПоДокументуОтчетОПереработке()
	
	ДокументОснование	= Объект.Документ;
	МетаданныеДокумента	= ДокументОснование.Метаданные();
	НомерЭкземпляра 	= 1;
	
	//:::Грузоотправитель
	ВидГрузоотправителя = КэшЗначений.ЮрЛицо;
	Если НЕ МетаданныеДокумента.Реквизиты.Найти("Грузоотправитель") = Неопределено 
		И ЗначениеЗаполнено(ДокументОснование.Грузоотправитель) Тогда
		
		ГрузоотправительДляПечати	= ДокументОснование.Грузоотправитель;
		
	ИначеЕсли ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиница) 
		И ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиница.Организация)  Тогда
		
		ГрузоотправительДляПечати	= ДокументОснование.СтруктурнаяЕдиница.Организация;
		
	Иначе
		
		ГрузоотправительДляПечати	= ДокументОснование.Организация;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГрузоотправительДляПечати) Тогда
	
		ЭтоФизЛицо					= (ГрузоотправительДляПечати.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
		ВидГрузоотправителя			= ?(ЭтоФизЛицо, КэшЗначений.ФизЛицо, КэшЗначений.ЮрЛицо);
		СведенияОГрузоотправителе 	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ГрузоотправительДляПечати, ДокументОснование.Дата);
		ЭтаФорма[?(ЭтоФизЛицо, "ГрузоотправительФЛ", "ГрузоотправительЮЛ")] 
			= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузоотправителе,
										?(ЭтоФизЛицо, "ПолноеНаименование, ИНН, ФактическийАдрес", 
														"ПолноеНаименование, ФактическийАдрес, Телефоны"));
														
														
		Если ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиница.МОЛ) Тогда
			
			ОтветственныйГрузоотправитель = РегистрыСведений.ФИОФизЛиц.ФИОФизЛица(ДокументОснование.Дата, ДокументОснование.СтруктурнаяЕдиница.МОЛ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеДоступностьюГрузоотправителяНаСервере();
	
	//:::Грузополучатель
	ВидГрузополучателя = КэшЗначений.ЮрЛицо;
	Если НЕ МетаданныеДокумента.Реквизиты.Найти("Грузополучатель") = Неопределено 
		И ЗначениеЗаполнено(ДокументОснование.Грузополучатель) Тогда
		
		ГрузополучательДляПечати	= ДокументОснование.Грузополучатель;
		
	Иначе
		
		ГрузополучательДляПечати	= ДокументОснование.Контрагент;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГрузополучательДляПечати) Тогда
		
		ЭтоФизЛицо					= (ГрузополучательДляПечати.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
										ИЛИ (ГрузополучательДляПечати.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо);
		ВидГрузополучателя			= ?(ЭтоФизЛицо, КэшЗначений.ФизЛицо, КэшЗначений.ЮрЛицо);
		СведенияОГрузополучателе	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ГрузополучательДляПечати, ДокументОснование.Дата);
		ЭтаФорма[?(ЭтоФизЛицо, "ГрузополучательФЛ", "ГрузополучательЮЛ")]
			= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузополучателе,
										?(ЭтоФизЛицо, "ПолноеНаименование, ИНН, ФактическийАдрес", 
														"ПолноеНаименование, ФактическийАдрес, Телефоны"));
														
		Если НЕ ГрузополучательДляПечати.Метаданные().Реквизиты.Найти("КонтактноеЛицо") = НЕОПРЕДЕЛЕНО Тогда
			
			ОтветственныйГрузополучатель = ГрузополучательДляПечати.КонтактноеЛицо.Наименование;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеДоступностьюГрузополучателяНаСервере();
	
	//:::Перевозчик
	ЗаполнитьПеревозчика(ДокументОснование, МетаданныеДокумента);
	
КонецПроцедуры //ЗаполнитьПоДокументуОтчетОПереработке()

&НаСервере
Процедура ЗаполнитьПоДокументуОснованию()
	
	Если НЕ ЗначениеЗаполнено(Объект.Документ) Тогда
		
		Возврат;
		
	ИначеЕсли ТипЗнч(Объект.Документ) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		ЗаполнитьПоДокументуРасходнаяНакладная();
		
	ИначеЕсли ТипЗнч(Объект.Документ) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		ЗаполнитьПоДокументуПеремещениеЗапасов();
		
	ИначеЕсли ТипЗнч(Объект.Документ) = Тип("ДокументСсылка.ОтчетОПереработке") Тогда
		
		ЗаполнитьПоДокументуОтчетОПереработке();
		
	ИначеЕсли ТипЗнч(Объект.Документ) = Тип("ДокументСсылка.алк_ТранспортировкаЗапасов") Тогда
		
		ЗаполнитьПоДокументуТранспортировкаЗапасов();
				
	ИначеЕсли ТипЗнч(Объект.Документ) = Тип("ДокументСсылка.алк_ОтгрузкаЩепы") Тогда
		
		ЗаполнитьПоДокументу_алк_ОтгрузкаЩепы();
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Собирает информационную строку о принятии заказа 
// по данным нескольких реквизитов формы
//
Процедура ОбновитьИнформациюОПринятииЗаказа()
	
	ИнформацияОПринятииЗаказа = "";
	
	Если ЗначениеЗаполнено(ДатаВидПереадресовки) Тогда
		
		ИнформацияОПринятииЗаказа = НСтр("ru = 'Заказ от '") + Формат(ДатаВидПереадресовки, "ДЛФ=DD");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресПереадресовки) Тогда
		
		ИнформацияОПринятииЗаказа = ИнформацияОПринятииЗаказа + НСтр("ru = '; заказ принял(а) '") + АдресПереадресовки;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПереадресовкаОтветственный) Тогда
		
		ИнформацияОПринятииЗаказа = ИнформацияОПринятииЗаказа + " (" + ПереадресовкаОтветственный + ")";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
//  Процедура восстанавливает настройки из хранилища общих настроек
//
//
Процедура ВосстановитьНастройки(Пользовательские = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользовательские Тогда
		
		СтруктураПолейФормы = ХранилищеОбщихНастроек.Загрузить("Обработки.ПечатьТН",	"Пользовательские",			"Настройки печати");
		
	Иначе
		
		СтруктураПолейФормы = ХранилищеОбщихНастроек.Загрузить("Обработки.ПечатьТН",	СокрЛП(Объект.Документ),	"Настройки печати",		"Общие");
		
	КонецЕсли;
	
	Если НЕ СтруктураПолейФормы = Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураПолейФормы);
		 
		Если НЕ ЗначениеЗаполнено(ВидГрузоотправителя) Тогда
			
			СтароеЗначениеВидГрузоотправителя = Неопределено;
			СтруктураПолейФормы.Свойство("ВидГрузоотправителя", СтароеЗначениеВидГрузоотправителя);
			
			ВидГрузоотправителя = ?(СтароеЗначениеВидГрузоотправителя = "Юр. лицо", КэшЗначений.ЮрЛицо, КэшЗначений.ФизЛицо);
			
		КонецЕсли;
		
		Если ВидГрузоотправителя = КэшЗначений.ФизЛицо 
			И ПустаяСтрока(ГрузоотправительФЛ) Тогда
			
			СтруктураПолейФормы.Свойство("Грузоотправитель", ГрузоотправительФЛ);
			
		КонецЕсли;
		
		Если ВидГрузоотправителя = КэшЗначений.ЮрЛицо 
			И ПустаяСтрока(ГрузоотправительЮЛ) Тогда
			
			СтруктураПолейФормы.Свойство("ГрузоотправительПродолжение", ГрузоотправительЮЛ);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВидГрузополучателя) Тогда
			
			СтароеЗначениеВидГрузополучателя = Неопределено;
			СтруктураПолейФормы.Свойство("ВидГрузополучателя", СтароеЗначениеВидГрузополучателя);
			
			ВидГрузополучателя = ?(СтароеЗначениеВидГрузополучателя = "Юр. лицо", КэшЗначений.ЮрЛицо, КэшЗначений.ФизЛицо);
			
		КонецЕсли;
		
		Если ВидГрузополучателя = КэшЗначений.ФизЛицо
			И ПустаяСтрока(ГрузополучательФЛ) Тогда
			
			СтруктураПолейФормы.Свойство("Грузополучатель", ГрузополучательФЛ);
			
		КонецЕсли;
		
		Если ВидГрузополучателя = КэшЗначений.ЮрЛицо
			И ПустаяСтрока(ГрузополучательЮЛ) Тогда
			
			СтруктураПолейФормы.Свойство("ГрузополучательПродолжение", ГрузополучательЮЛ);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВидПеревозчика) Тогда
			
			СтароеЗначениеВидПеревозчика = Неопределено;
			СтруктураПолейФормы.Свойство("ВидПеревозчика", СтароеЗначениеВидПеревозчика);
			
			ВидПеревозчика = ?(СтароеЗначениеВидПеревозчика = "Юр. лицо", КэшЗначений.ЮрЛицо, КэшЗначений.ФизЛицо);
			
		КонецЕсли;
		
		Если ВидПеревозчика = КэшЗначений.ФизЛицо
			И ПустаяСтрока(ПеревозчикФЛ) Тогда
			
			СтруктураПолейФормы.Свойство("Перевозчик", ПеревозчикФЛ);
			
		КонецЕсли;
		
		Если ВидПеревозчика = КэшЗначений.ЮрЛицо
			И ПустаяСтрока(ПеревозчикЮЛ) Тогда
			
			СтруктураПолейФормы.Свойство("ПеревозчикПродолжение", ПеревозчикЮЛ);
			
		КонецЕсли; 
		
		//СведенияОПеревозчике = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ПеревозчикФЛ, Объект.Документ.Дата);
		//СведенияОПеревозчике.ЮридическийАдрес = СведенияОПеревозчике.ФактическийАдрес;
		//АдресВыгрузки = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование, ФактическийАдрес");

		УправлениеДоступностьюГрузоотправителяНаСервере();
		
		УправлениеДоступностьюГрузополучателяНаСервере();
		
		УправлениеДоступностьюПеревозчикаНаСервере();
		
	Иначе
		
		// Заполним повторно поля значениями из документа
		ЗаполнитьПоДокументуОснованию();
		
	КонецЕсли;
	ЗаполнитьПоДокументуОснованию();
КонецПроцедуры // ВосстановитьНастройки()

&НаСервере
//  Процедура сохраняет настройки в хранилище общих настроек
//
//
Процедура СохранитьНастройки(Пользовательские = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПолейФормы = СформироватьСтруктуруПолейФормыНаСервере();
	
	Если Пользовательские Тогда
		
		ХранилищеОбщихНастроек.Сохранить("Обработки.ПечатьТН",	"Пользовательские", 		СтруктураПолейФормы,	"Настройки печати");
		
	Иначе
		
		ХранилищеОбщихНастроек.Сохранить("Обработки.ПечатьТН",	СокрЛП(Объект.Документ),	СтруктураПолейФормы,	"Настройки печати",	"Общие");
		
	КонецЕсли;
	
КонецПроцедуры //СохранитьПользовательскийШаблон()

&НаСервере
//  Формирует структуру заполненую значениями полей формы
//
//  Ключ структуры	- идентификатор поля;
//  Значение 		- значение поля;
//  
Функция СформироватьСтруктуруПолейФормыНаСервере()
	
	СтруктураПолейФормы = Новый Структура();
	
	//::: Раздел 0 (Шапка и заголовки)
	СтруктураПолейФормы.Вставить("НомерЭкземпляра", 				НомерЭкземпляра);
	СтруктураПолейФормы.Вставить("ДатаЗаявки", 						ДатаЗаявки);
	СтруктураПолейФормы.Вставить("НомерЗаявки", 					НомерЗаявки);
	
	//::: Раздел 1
	СтруктураПолейФормы.Вставить("ВидГрузоотправителя", 			ВидГрузоотправителя);
	СтруктураПолейФормы.Вставить("ГрузоотправительФЛ", 				ГрузоотправительФЛ);
	СтруктураПолейФормы.Вставить("ГрузоотправительЮЛ",				ГрузоотправительЮЛ);
	
	//::: Раздел 2
	СтруктураПолейФормы.Вставить("ВидГрузополучателя", 				ВидГрузополучателя);
	СтруктураПолейФормы.Вставить("ГрузополучательФЛ", 				ГрузополучательФЛ);
	СтруктураПолейФормы.Вставить("ГрузополучательЮЛ",				ГрузополучательЮЛ);
	
	//::: Раздел 3
	СтруктураПолейФормы.Вставить("НаименованиеГруза", 				НаименованиеГруза);
	СтруктураПолейФормы.Вставить("КоличествоМестМаркировка",		КоличествоМестМаркировка);
	СтруктураПолейФормы.Вставить("ГрузовыеМеста", 					ГрузовыеМеста);
	СтруктураПолейФормы.Вставить("ИнформацияПоОпастнымВеществам",	ИнформацияПоОпастнымВеществам);
	
	//::: Раздел 4
	СтруктураПолейФормы.Вставить("ПрилагаемыеДокументы", 			ПрилагаемыеДокументы);
	СтруктураПолейФормы.Вставить("ПрилагаемыеСертификаты", 			ПрилагаемыеСертификаты);
	
	//::: Раздел 5
	СтруктураПолейФормы.Вставить("ПараметрыТранспортногоСредства",	ПараметрыТранспортногоСредства);
	СтруктураПолейФормы.Вставить("НеобходимыеУказания", 			НеобходимыеУказания);
	СтруктураПолейФормы.Вставить("Рекомендации", 					Рекомендации);
	
	//::: Раздел 6
	СтруктураПолейФормы.Вставить("АдресПогрузки", 					АдресПогрузки);
	СтруктураПолейФормы.Вставить("СрокПодачиПодПогрузку", 			СрокПодачиПодПогрузку);
	СтруктураПолейФормы.Вставить("ФактическоеПрибылПараграф6",		ФактическоеПрибылПараграф6);
	СтруктураПолейФормы.Вставить("ФактическоеУбылПараграф6",		ФактическоеУбылПараграф6);
	СтруктураПолейФормы.Вставить("СостояниеГрузаПриПогрузке",		СостояниеГрузаПриПогрузке);
	СтруктураПолейФормы.Вставить("МассаГрузаПриЗагрузке",			МассаГрузаПриЗагрузке);
	СтруктураПолейФормы.Вставить("КоличествоМестПриЗагрузке", 		КоличествоМестПриЗагрузке);
	СтруктураПолейФормы.Вставить("ПодписьГрузоотправителяПараграф6",ПодписьГрузоотправителяПараграф6);
	СтруктураПолейФормы.Вставить("ПодписьВодителяПараграф6", 		ПодписьВодителяПараграф6);
	
	//::: Раздел 7
	СтруктураПолейФормы.Вставить("АдресВыгрузки", 					АдресВыгрузки);
	СтруктураПолейФормы.Вставить("СрокПодачиПодВыгрузку", 			СрокПодачиПодВыгрузку);
	СтруктураПолейФормы.Вставить("ФактическоеПрибылПараграф7", 		ФактическоеПрибылПараграф7);
	СтруктураПолейФормы.Вставить("ФактическоеУбылПараграф7", 		ФактическоеУбылПараграф7);
	СтруктураПолейФормы.Вставить("СостояниеГрузаПриПогрузке",		СостояниеГрузаПриВыгрузке);
	СтруктураПолейФормы.Вставить("МассаГрузаПриВыгрузке",			МассаГрузаПриВыгрузке);
	СтруктураПолейФормы.Вставить("КоличествоМестПриВыгрузке", 		КоличествоМестПриВыгрузке);
	СтруктураПолейФормы.Вставить("ПодписьГрузоотправителяПараграф7",ПодписьГрузоотправителяПараграф7);
	СтруктураПолейФормы.Вставить("ПодписьВодителяПараграф7", 		ПодписьВодителяПараграф7);
	
	//::: Раздел 8
	СтруктураПолейФормы.Вставить("СрокУтратыГруза", 				СрокУтратыГруза);
	СтруктураПолейФормы.Вставить("РазмерОплатыИПредСрокХранения",	РазмерОплатыИПредСрокХранения);
	СтруктураПолейФормы.Вставить("СпособОпределенияМассыГруза",		СпособОпределенияМассыГруза);
	СтруктураПолейФормы.Вставить("ШтрафПоВинеПеревозчика", 			ШтрафПоВинеПеревозчика);
	СтруктураПолейФормы.Вставить("ШтрафЗаПростой", 					ШтрафЗаПростой);
	
	//::: Раздел 9
	СтруктураПолейФормы.Вставить("ДатаПринятияЗаказа", 				ДатаВидПереадресовки);
	СтруктураПолейФормы.Вставить("ЗаказПринял", 					АдресПереадресовки);
	СтруктураПолейФормы.Вставить("ДолжностьПринявшегоЗаказ",		ПереадресовкаОтветственный);
	
	//::: Раздел 10
	СтруктураПолейФормы.Вставить("ВидПеревозчика", 					ВидПеревозчика);
	СтруктураПолейФормы.Вставить("ПеревозчикФЛ", 					ПеревозчикФЛ);
	СтруктураПолейФормы.Вставить("ПеревозчикЮЛ",					ПеревозчикЮЛ);
	СтруктураПолейФормы.Вставить("ОтветственныйЗаПеревозку",		ОтветственныйЗаПеревозку);
	
	//::: Раздел 11
	СтруктураПолейФормы.Вставить("ТипМарка", 						ТипМарка);
	СтруктураПолейФормы.Вставить("РегистрационныеНомера",			РегистрационныеНомера);
	
	//::: Раздел 12
	СтруктураПолейФормы.Вставить("ФактическоеСостояниеГруза",		ФактическоеСостояниеГруза);
	СтруктураПолейФормы.Вставить("ИзменениеУсловийПеревозки",		ИзменениеУсловийПеревозки);
	СтруктураПолейФормы.Вставить("ФактическоеСостояниеТары",		ФактическоеСостояниеТары);
	СтруктураПолейФормы.Вставить("ИзменениеУсловийПриВыгрузке",		ИзменениеУсловийПриВыгрузке);
	
	//::: Раздел 13
	СтруктураПолейФормы.Вставить("ПрочиеУсловия", 					ПрочиеУсловия);
	СтруктураПолейФормы.Вставить("РежимТрудаИОтдыхаВодителя",		РежимТрудаИОтдыхаВодителя);
	
	//::: Раздел 14
	СтруктураПолейФормы.Вставить("ДатаФормаПереадресовки",			ДатаФормаПереадресовки);
	СтруктураПолейФормы.Вставить("Переадресовщик", 					Переадресовщик);
	СтруктураПолейФормы.Вставить("НовыйПунктВыгрузки", 				НовыйПунктВыгрузки);
	СтруктураПолейФормы.Вставить("НовыйПолучательГруза", 			НовыйПолучательГруза);
	
	//::: Раздел 15
	СтруктураПолейФормы.Вставить("ГрузоотправительКраткоПункт15_1", ГрузоотправительКраткоПункт15_1);
	//СтруктураПолейФормы.Вставить("ПорядокРасчета", 					ПорядокРасчета);
	//СтруктураПолейФормы.Вставить("РазмерПровознойПлаты", 			РазмерПровознойПлаты);
	//СтруктураПолейФормы.Вставить("РасходыДляПредъявленияГрузоотправителю", РасходыДляПредъявленияГрузоотправителю);
	//СтруктураПолейФормы.Вставить("УплатаТаможенныхСборовИПошлин",	УплатаТаможенныхСборовИПошлин);
	//СтруктураПолейФормы.Вставить("ВыполнениеПогрузоРазгрузочныхРабот", ВыполнениеПогрузоРазгрузочныхРабот);
	//СтруктураПолейФормы.Вставить("ГрузоотправительПункт15_6", 		ГрузоотправительПункт16_1);
	
	//::: Раздел 16 (раздел отсутствует)
	СтруктураПолейФормы.Вставить("ГрузоотправительПункт16_1",	ГрузоотправительПункт16_1);
	//СтруктураПолейФормы.Вставить("ДатаСоставленияГрузоотправитель",	ДатаСоставленияГрузоотправитель);
	СтруктураПолейФормы.Вставить("ПеревозчикПункт16_2", 		ПеревозчикПункт16_2);
	//СтруктураПолейФормы.Вставить("ДатаСоставленияПеревозчик", 		ДатаСоставленияПеревозчик);
	
	//::: Раздел 17 (раздел отсутствует)
	
	Возврат СтруктураПолейФормы;
	
КонецФункции  // СформироватьСтруктуруПолейФормыНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ И КОМАНД

&НаКлиенте
// Процедура открывает форму для печати ТТН
//
Процедура ПечатьТН(Команда)
	
	НеЗаполняетсяИзФормы = "";
	
	ПараметрыПечати = Новый Структура();
	
	//::: Раздел 0 (шапка и заголовки)
	ПараметрыПечати.Вставить("Пункт0_1", НомерЭкземпляра);
	ПараметрыПечати.Вставить("Пункт0_2", ДатаЗаявки);
	ПараметрыПечати.Вставить("Пункт0_3", НомерЗаявки);
	
	//::: Раздел 1
	ПараметрыПечати.Вставить("Пункт1_1",?(ЭтоФизЛицо(ВидГрузоотправителя),ГрузоотправительФЛ,ГрузоотправительЮЛ));
	//ПараметрыПечати.Вставить("Пункт1а_1", ГрузоотправительЮЛ);  //1а Клиент
	//ПараметрыПечати.Вставить("Пункт1_2", ДоговорНаОказаниеУслуг);//1а Клиент
	
	//::: Раздел 2 
	ПараметрыПечати.Вставить("Пункт2_1", ?(ЭтоФизЛицо(ВидГрузополучателя),ГрузополучательФЛ,ГрузополучательЮЛ));
	ПараметрыПечати.Вставить("Пункт2_2", АдресМестаДоставки);    
	
	//::: Раздел 3
	ПараметрыПечати.Вставить("Пункт3_1", НаименованиеГруза);
	ПараметрыПечати.Вставить("Пункт3_2", КоличествоМестМаркировка);
	ПараметрыПечати.Вставить("Пункт3_3", ГрузовыеМеста);
	ПараметрыПечати.Вставить("Пункт3_4", ИнформацияПоОпастнымВеществам);
	ПараметрыПечати.Вставить("Пункт3_5", Ценность);
	
	//::: Раздел 4
	ПараметрыПечати.Вставить("Пункт4_1", ПрилагаемыеДокументы);
	ПараметрыПечати.Вставить("Пункт4_2", ПрилагаемыеСертификаты);
	
	//::: Раздел 5
	ПараметрыПечати.Вставить("Пункт5_1", ПараметрыТранспортногоСредства);
	ПараметрыПечати.Вставить("Пункт5_2", НеобходимыеУказания);
	ПараметрыПечати.Вставить("Пункт5_3", Рекомендации);
	
	//::: Раздел 6
	ПараметрыПечати.Вставить("Пункт6_1", ?(ЭтоФизЛицо(ВидПеревозчика),ПеревозчикФЛ,ПеревозчикЮЛ));
	//ПараметрыПечати.Вставить("Пункт10_2", ПеревозчикЮЛ);
	ПараметрыПечати.Вставить("Пункт6_2", ОтветственныйЗаПеревозку);
	
	//::: Раздел 7
	ПараметрыПечати.Вставить("Пункт7_1", ТипМарка);
	ПараметрыПечати.Вставить("Пункт7_2", РегистрационныеНомера);

	//::: Раздел 8
	ПараметрыПечати.Вставить("Пункт8_1", УполномоченныйВыдача);
	ПараметрыПечати.Вставить("Пункт8_2", АдресПогрузки);
	ПараметрыПечати.Вставить("Пункт8_3", СрокПодачиПодПогрузку);
	ПараметрыПечати.Вставить("Пункт8_4", ФактическоеПрибылПараграф6);
	ПараметрыПечати.Вставить("Пункт8_41", ФактическоеУбылПараграф6);
	ПараметрыПечати.Вставить("Пункт8_6", СостояниеГрузаПриПогрузке);
	ПараметрыПечати.Вставить("Пункт8_5", МассаГрузаПриЗагрузке);
	ПараметрыПечати.Вставить("Пункт8_51", КоличествоМестПриЗагрузке);
	ПараметрыПечати.Вставить("Пункт8_7", ПодписьГрузоотправителяПараграф6);
	ПараметрыПечати.Вставить("Пункт8_8", ПодписьВодителяПараграф6);
	
	//::: Раздел 9
	ПараметрыПечати.Вставить("Пункт9_1", ДатаФормаПереадресовки);
	ПараметрыПечати.Вставить("Пункт9_2", Переадресовщик);
	ПараметрыПечати.Вставить("Пункт9_3", НовыйПунктВыгрузки);
	ПараметрыПечати.Вставить("Пункт9_4", НовыйПолучательГруза);
	
	//::: Раздел 10
	ПараметрыПечати.Вставить("Пункт10_1", АдресВыгрузки);
	ПараметрыПечати.Вставить("Пункт10_2", СрокПодачиПодВыгрузку);
	ПараметрыПечати.Вставить("Пункт10_3", ФактическоеПрибылПараграф7);
	ПараметрыПечати.Вставить("Пункт10_31", ФактическоеУбылПараграф7);
	ПараметрыПечати.Вставить("Пункт10_4", СостояниеГрузаПриВыгрузке);
	ПараметрыПечати.Вставить("Пункт10_5", МассаГрузаПриВыгрузке);
	ПараметрыПечати.Вставить("Пункт10_6", КоличествоМестПриВыгрузке); 
	ПараметрыПечати.Вставить("Пункт10_7", СостояниеГрузаПриПогрузке);
	ПараметрыПечати.Вставить("Пункт10_8", ПодписьГрузоотправителяПараграф7);
	ПараметрыПечати.Вставить("Пункт10_9", ПодписьВодителяПараграф7);
	
	////::: Раздел 8
	//ПараметрыПечати.Вставить("Пункт8_1", СрокУтратыГруза);
	//ПараметрыПечати.Вставить("Пункт8_2", РазмерОплатыИПредСрокХранения);
	//ПараметрыПечати.Вставить("Пункт8_3", СпособОпределенияМассыГруза);
	//ПараметрыПечати.Вставить("Пункт8_4", ШтрафПоВинеПеревозчика);
	//ПараметрыПечати.Вставить("Пункт8_5", ШтрафЗаПростой);
	//

	//	//::: Раздел 10
	//ПараметрыПечати.Вставить("Пункт10_1", ПеревозчикФЛ);
	//ПараметрыПечати.Вставить("Пункт10_2", ПеревозчикЮЛ);
	//ПараметрыПечати.Вставить("Пункт10_3", ОтветственныйЗаПеревозку);
	
	////::: Раздел 11
	//ПараметрыПечати.Вставить("Пункт11_1", ТипМарка);
	//ПараметрыПечати.Вставить("Пункт11_2", РегистрационныеНомера);
	
	////::: Раздел 12
	//ПараметрыПечати.Вставить("Пункт12_1", ФактическоеСостояниеГруза);
	//ПараметрыПечати.Вставить("Пункт12_2", ИзменениеУсловийПеревозки);
	//ПараметрыПечати.Вставить("Пункт12_3", ФактическоеСостояниеТары);
	//ПараметрыПечати.Вставить("Пункт12_4", ИзменениеУсловийПриВыгрузке);
	//
	////::: Раздел 13
	//ПараметрыПечати.Вставить("Пункт13_1", ПрочиеУсловия);
	//ПараметрыПечати.Вставить("Пункт13_2", РежимТрудаИОтдыхаВодителя);
	//
	////::: Раздел 14
	//ПараметрыПечати.Вставить("Пункт14_1", ДатаФормаПереадресовки);
	//ПараметрыПечати.Вставить("Пункт14_2", Переадресовщик);
	//ПараметрыПечати.Вставить("Пункт14_3", НовыйПунктВыгрузки);
	//ПараметрыПечати.Вставить("Пункт14_4", НовыйПолучательГруза);
	//
	//////::: Раздел 15
	////ПараметрыПечати.Вставить("Пункт15_1", "" + СтоимостьУслугиВНациональнойВалюте + " руб.; " + ПорядокРасчета);
	////ПараметрыПечати.Вставить("Пункт15_2", РазмерПровознойПлаты);
	////ПараметрыПечати.Вставить("Пункт15_3", РасходыДляПредъявленияГрузоотправителю);
	////ПараметрыПечати.Вставить("Пункт15_4", УплатаТаможенныхСборовИПошлин);
	////ПараметрыПечати.Вставить("Пункт15_5", ВыполнениеПогрузоРазгрузочныхРабот);
	//ПараметрыПечати.Вставить("Пункт15_1", ГрузоотправительКраткоПункт15_1);  
	//ПараметрыПечати.Вставить("Пункт15_3", ПеревозчикКраткоПункт15_3);
	//
	////::: Раздел 12
	ПараметрыПечати.Вставить("Пункт12_1", СтоимостьУслугиВНациональнойВалюте);
	ПараметрыПечати.Вставить("Пункт12_2", НалоговаяСтавка); 
	ПараметрыПечати.Вставить("Пункт12_3", СуммаНалога);
	ПараметрыПечати.Вставить("Пункт12_4", СтоимостьУслугиВНациональнойВалюте+СуммаНалога);
	ПараметрыПечати.Вставить("Пункт12_5", ПорядокРасчета);
	ПараметрыПечати.Вставить("Пункт12_7", ГрузоотправительПункт16_1);
	//ПараметрыПечати.Вставить("Пункт16_2", ДатаСоставленияГрузоотправитель);
	ПараметрыПечати.Вставить("Пункт12_6", ПеревозчикПункт16_2);
	//ПараметрыПечати.Вставить("Пункт16_4", ДатаСоставленияПеревозчик);
	ПараметрыПечати.Вставить("Пункт12_8", ДоговорНаОказаниеУслуг); //УПГ
	
	//::: Раздел 17 (параграф не содержит параметров)
	
	ПараметрКоманды 			= Новый Массив;
	ПараметрКоманды.Добавить(Объект.Документ);
	ПараметрыВыполненияКоманды 	= Новый Структура;
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.алк_ПечатьТН", "ТН", ПараметрКоманды, ПараметрыВыполненияКоманды, ПараметрыПечати);
	
	//::: Запомним значения реквизитов формы для документа
	СохранитьНастройки(Ложь);
	
КонецПроцедуры //ПечатьТНВыполнить()

Функция РасчитатьСуммуНалога()
	Возврат СтоимостьУслугиВНациональнойВалюте/100*НалоговаяСтавка.Ставка;
КонецФункции

Функция ЭтоФизЛицо(ФизЮрЛицо) 
	Возврат  ФизЮрЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо  		
КонецФункции

&НаСервере
// Процедура обработчик события ПриСозданииНаСервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") Тогда
		
		Объект.Документ = Параметры.Документ;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЭР") Тогда  
		Элементы.КнопкаПечатьТТН.Видимость = Ложь;
		Элементы.КнопкаПечатьЭР.Видимость = Истина;
	КонецЕсли;
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ЮрЛицо", Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	КэшЗначений.Вставить("ФизЛицо", Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
	
	ВосстановитьНастройки(Ложь);
	
КонецПроцедуры //ПриСозданииНаСервере()
                        
&НаКлиенте
// Процедура - обработчик команды Заполнить
// 
Процедура Заполнить()
	
	ЗаполнитьПоДокументуОснованию();
	
КонецПроцедуры //Заполнить()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ДатаПринятияЗаказа
//
Процедура ДатаПринятияЗаказваПриИзменении(Элемент)
	
	ОбновитьИнформациюОПринятииЗаказа();
	
КонецПроцедуры //ДатаПринятияЗаказваПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ЗаказПринял
//
Процедура ЗаказПринялПриИзменении(Элемент)
	
	ОбновитьИнформациюОПринятииЗаказа();
	
КонецПроцедуры //ЗаказПринялПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ДолжностьПринявшегоЗаказ
Процедура ДолжностьПринявшегоЗаказПриИзменении(Элемент)
	
	ОбновитьИнформациюОПринятииЗаказа();
	
КонецПроцедуры //ДолжностьПринявшегоЗаказПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Документ
//
Процедура ДокументПриИзменении(Элемент)
	
	Заполнить()
	
КонецПроцедуры //ДокументПриИзменении()

&НаКлиенте
//  Процедура инициализирует сохранение значений полей формы
//  в хранилище общих настроек.
//
Процедура СохранитьЗначениеПолей(Команда)
	
	СохранитьНастройки();
	
КонецПроцедуры //СохранитьЗначениеПолей()

&НаКлиенте
//  Процедура инициализирует восстановление настройки для пользователя
//  и заполнение полей формы из восстановленной настройки
//
Процедура ВосстановитьЗначениеПолей(Команда)
	
	ВосстановитьНастройки();
	
КонецПроцедуры //ВосстановитьЗначениеПолей()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВидГрузоотправителяПриИзменении(Элемент)
	
	Если ВидГрузоотправителя = КэшЗначений.ЮрЛицо Тогда
		
		ГрузоотправительФЛ = "";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузоотправительЮЛ", "Доступность", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузоотправительФЛ", "Доступность", Ложь);
		
	Иначе
		
		ГрузоотправительЮЛ = "";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузоотправительЮЛ", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузоотправительФЛ", "Доступность", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидГрузополучателяПриИзменении(Элемент)
	
	Если ВидГрузополучателя = КэшЗначений.ЮрЛицо Тогда
		
		ГрузополучательФЛ = "";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузополучательЮЛ", "Доступность", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузополучательФЛ", "Доступность", Ложь);
		
	Иначе
		
		ГрузополучательЮЛ = "";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузополучательЮЛ", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузополучательФЛ", "Доступность", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПеревозчикаПриИзменении(Элемент)
	
	Если ВидПеревозчика = КэшЗначений.ЮрЛицо Тогда
		
		ПеревозчикФЛ = "";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеревозчикЮЛ", "Доступность", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеревозчикФЛ", "Доступность", Ложь);
		
	Иначе
		
		ПеревозчикЮЛ = "";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеревозчикЮЛ", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеревозчикФЛ", "Доступность", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалоговаяСтавкаПриИзменении(Элемент)
	СуммаНалога = РасчитатьСуммуНалога(); 
	СтоимостьСНалогом = СтоимостьУслугиВНациональнойВалюте+СуммаНалога; 
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьУслугиВНациональнойВалютеПриИзменении(Элемент)
	СуммаНалога = РасчитатьСуммуНалога(); 
	СтоимостьСНалогом = СтоимостьУслугиВНациональнойВалюте+СуммаНалога; 
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭР(Команда)
	
	НеЗаполняетсяИзФормы = "";  
	 
	ВернутьЭРНаСервере().Показать();	
		
	//::: Запомним значения реквизитов формы для документа
	СохранитьНастройки(Ложь);

КонецПроцедуры        

&НаСервере
Функция ВернутьЭРНаСервере()  
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЭкспедиторскаяРаспискаДГ";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПФ_MXL_ЭкспедиторскаяРаспискаДГ");;
	Область = Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.НомерСпецификации = Объект.Документ.Номер;
	Область.Параметры.Дата = Объект.Документ.Дата; 
	Область.Параметры.Экспедитор = ПеревозчикЮЛ;
	Область.Параметры.КоличествоВидУпаковки = КоличествоМестПриВыгрузке;
	Область.Параметры.ВесНеттоБрутто = МассаГрузаПриВыгрузке;
	Область.Параметры.ФИОВодителя = ПодписьВодителяПараграф7;
	
	ТабДок.Вывести(Область);
	
	Возврат ТабДок;
	
КонецФункции
